<template>

    <div class="main">
        <link href="https://fonts.googleapis.com/css2?family=Roboto:wght@300;700&display=swap" rel="stylesheet">

        <div class="header">
            <div class="header__photo">
                <img src="../photo/history1.png" alt="">
                <div class="header__photo-text">
                    <span>история</span>
                </div>
            </div>
        </div>
        <div class="body">
            <div class="body__text">
                <p>Гребной клуб Университета ИТМО - это не просто гребной спорт. Это команда, где каждый может найти что-то интересное для себя - от профессионального спорта до спортивного журналиста и фотографа.
                </p>
                <p>Существуем с 2013 года.
                </p>
                <p>В этом году наша команда впервые вышла на мировой уровень. За это лето мы побывали в 4 странах и участвовали в 3 международных соревнованиях - в Китае, Польше и Германии, где боролись с лучшими командами всего мира.
                </p>
                <p class="bold">Для тех, кто хочет попасть к нам в команду
                </p>
                <p>Скорее всего вы раньше не занимались гребным спортом и не слышали о нем, но для нас это не важно, ведь нас тренируют одни из лучших тренеров России, которые готовы доказать, что гребля, которая задействует 95% мышц является очень функциональным и очень красивым спортом.
                </p>
                <p>Гребной спорт - это то, что развивает у человека как выносливость, так и мышечную память, и силу, а также наращивает объем мышц. Каждый раз выполняя трудное задание ты понимаешь, что ты должен его доделать, так и вырабатывается стальной характер гребца, потому что как только вы сможете справиться с тяжелыми упражнениями каждый день, то вы спокойно сможете справляться и с трудностями в учебе и в работе.</p>
                <img src="../photo/history1.png" alt="">
                <p class="bold">Тренировки</p>
                <p>Тренировки нашей команды проходят как на воде, так и на суше. И когда водный сезон закрывается мы уходим в зал и начинается работа с железом и с гребным тренажером.
                </p>
                <p>Конечно, каждая тренировка в основной части команды это труд, на каждой тренировке ты должен выложиться по полной, но это еще больше подбадривает после тренировки не просто лечь на диван, а заняться чем-то полезным по учебе/работе.
                </p>
                <p>Пока тренировки проходят на воде команда должна вместе прийти к заранее обговоренному времени, чтобы собрать полный состав в лодку. Но когда начинается зимний сезон часто бывает, что каждый объединяется в малые группы для выполнения задания, чтобы сыкономить свое вермя и выбрать более удобный график.</p>
                <img src="../photo/history3.png" alt="">
                <p class="bold">Команда</p>
                <p>Ну и конечно без отдыха мы не можем. Наша команда сильно объединяет людей друг с другом, потому что каждый видит каждого очень часто. В особенности на сборах, и когда все собираются в баню или поесть шашлык это безусловно приятно.
                </p>
                <p>Ну и также не остается без различных мероприятий в городе, где каждый член клуба может получить свой подарок.</p>
                <img src="../photo/history4.png" alt="" style="width: 45%; margin-right: 2%;">
                <img src="../photo/history5.png" alt="" style="width: 45%; margin-left: 2%;">
            </div>
        </div>
    </div>
</template>

<script>

    export default {
        name: "History",
    }
</script>

<style scoped lang="scss">

    .main{
        font-family: 'Roboto', sans-serif;
    }

    .header{
        margin-top: 142px;

        &__photo{
            position: relative;
            width: 90vw;
            margin: 0 auto;
            & img{
                width: 100%;
            }
            &-text{
                position: absolute;
                top: 0;
                left: 0.8%;
                text-transform: uppercase;
                font-size: 48px;
                font-weight: 700;
                background-color: rgba(61, 80, 132, 0.9);
                margin-top: 5px;
                padding: 15px 30px;
                color: #fff;
            }
         }
    }
    .body{
        position: relative;
        z-index: 2;
        background: #fff;
        margin: 0 auto;
        margin-top: -7%;
        width: 56%;
        &__text{
            font-size: 18px;
            padding: 65px 70px;
            & .bold{
                font-weight: 700;
            }
            & img{
                width: 100%;
                margin-bottom: 15px;
            }
        }
    }

    @media (max-width: 1023px) {
        .header{
            &__photo{
                &-text{
                    position: static;
                    padding: 0;
                    font-size: 28px;
                    text-align: center;
                    background: #fff;
                    color: #414E7E;
                    margin: 20px 0;
                }
            }
        }
        .body{
            width: 90%;
            margin-top: 0;
            &__text{
                padding: 0;
                font-size: 14px;
            }
        }

    }
    .r{
        outline: solid 2px red;
    }

</style>